#### Terraform Format 🖌 ``
#### Terraform Validate 🤖 ``
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
module.resource_group["rg-demo"].data.modtm_module_source.telemetry[0]: Reading...
module.resource_group["rg-demo"].data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group["rg-demo"].data.azurerm_subscription.current: Reading...
module.resource_group["rg-demo"].data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group["rg-demo"].data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04NGI4NGM0MS1jZDkxLTRlNjktYmZkNC0xZmI0ZGY5YmEzYjE7b2JqZWN0SWQ9ZDgzYzhhZjktM2MwYS00ZDg0LTk3OTktZmI1N2JhNWQwNzBiO3N1YnNjcmlwdGlvbklkPWZiMDA2YTk1LTZlMDEtNDg1Mi04YWRjLWMwOTRkYjRkYTA4ZDt0ZW5hbnRJZD1mZDhhOTZiYy04NWFjLTRmNzUtOGUxMS02NjEzYjFhYTRmZDM=]
module.resource_group["rg-demo"].data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/fb006a95-6e01-4852-8adc-c094db4da08d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.nsg["nsg-web"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.nsg["nsg-web"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/nsg"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.nsg["nsg-web"].azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg-web"
      + resource_group_name = "rg-free-demo"
      + security_rule       = (known after apply)
    }

  # module.nsg["nsg-web"].azurerm_network_security_rule.this["SSH"] will be created
  + resource "azurerm_network_security_rule" "this" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "SSH"
      + network_security_group_name = "nsg-web"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-free-demo"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg["nsg-web"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.nsg["nsg-web"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.resource_group["rg-demo"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-free-demo"
    }

  # module.resource_group["rg-demo"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-resources-resourcegroup/azurerm"
          + "module_version"  = "0.2.1"
          + "random_id"       = (known after apply)
          + "subscription_id" = "fb006a95-6e01-4852-8adc-c094db4da08d"
          + "tenant_id"       = "fd8a96bc-85ac-4f75-8e11-6613b1aa4fd3"
        }
    }

  # module.resource_group["rg-demo"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm["vm-web"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.vm["vm-web"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/vm"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.vm["vm-web"].azurerm_linux_virtual_machine.this[0] will be created
  + resource "azurerm_linux_virtual_machine" "this" {
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = "vm-web-dgc"
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "vm-web-dgc"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-free-demo"
      + size                                                   = "Standard_B1s"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDEjOSWslXXlf5XcB6PQW4Eid+WYuIFVFldMRbBqGBfesHK0aI0JT3NXcDZnDtDLwqB/BiNDTF7JPNwip6XyV+Rs1ZpMMGW4bex7WZwydUyl/+rwmFYjGKsgEfRy3ExJ8CnQScVcQ4On6O04Y7twLCs2Oq1/V5NFpsr6M6yUi0Xbgly1Ox8BX8BifNC/kwF7I9hwrTfrDcONkXlzOnSiuxkJ82km+YDTKVNtfsli92Y3ghlE/zjjGna+NpCcuKbCGH8E86ypXmhX0bEVP0/x7jS4jTLmeFF37p0+IL/GqMpPXvjZdZ/LfSAS3O3rE9Nmmj+fi7ZTM0HSRdryy051IFkGGMC92D1wkU/6HKHAuPfq/PIF566i66eVDs2KpWak0CF4BAIe5buXivvbMWOz0vP36wrHc81QxhnRoY1ksHFSCSjbM8NJ6PLlhtUOz4vWVJnjL8KM0+mLZdFNxidpea7oqbzQddZpby0C626MQ9md9MEAk/m3ukLtXMWSw9SmqZknUMWozRkm0GgD6frANviOFHt9THrWjmY5FWBY7/cLua7xtRaL7AShzkMgJqIAD9vmqM8edG25Wcm34NTs34dfBTYIsNoI+DIn+Pi5r7B8EnwM1OUuINrbX/i5LfT1PSTghhETVwFR7Z5zszUaOOqkeUXT9L8DtmRpCRCwpvnSw== opc@dgc-gitops1
            EOT
          + username   = "azureuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 30
          + id                        = (known after apply)
          + name                      = "vm-web-dgc-osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm["vm-web"].azurerm_network_interface.virtualmachine_network_interfaces["nic"] will be created
  + resource "azurerm_network_interface" "virtualmachine_network_interfaces" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "vm-web-dgc-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-free-demo"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = true
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm["vm-web"].azurerm_network_interface_security_group_association.this["nic-nsg_association"] will be created
  + resource "azurerm_network_interface_security_group_association" "this" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # module.vm["vm-web"].azurerm_public_ip.virtualmachine_public_ips["nic-ipconfig1"] will be created
  + resource "azurerm_public_ip" "virtualmachine_public_ips" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 30
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "vm-web-dgc-publicip"
      + resource_group_name     = "rg-free-demo"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.vm["vm-web"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.vm["vm-web"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vm["vm-web"].tls_private_key.this[0] will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.vnet["vnet-demo"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.vnet["vnet-demo"].data.azurerm_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "this" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.vnet["vnet-demo"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/vnet"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.vnet["vnet-demo"].azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = null
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "eastus"
      + name                      = "vnet-free-demo"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2023-11-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.vnet["vnet-demo"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.vnet["vnet-demo"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.vnet["vnet-demo"].module.subnet["subnet-public"].azapi_resource.subnet will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.1.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet-public"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2023-11-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + deployment_summary = {
      + message          = "Check Azure portal for VM public IP addresses"
      + networks         = {
          + created  = 1
          + existing = 0
          + total    = 1
        }
      + resource_groups  = {
          + created  = 1
          + existing = 0
          + total    = 1
        }
      + security_groups  = {
          + created  = 1
          + existing = 0
          + total    = 1
        }
      + virtual_machines = {
          + total = 1
        }
    }
  + networks           = {
      + vnet-demo = {
          + cidr    = "10.0.0.0/16"
          + id      = (known after apply)
          + name    = "vnet-free-demo"
          + source  = "created"
          + subnets = {
              + subnet-public = {
                  + cidr   = "10.0.1.0/24"
                  + id     = (known after apply)
                  + name   = "subnet-public"
                  + source = "created"
                }
            }
        }
    }
  + resource_groups    = {
      + rg-demo = {
          + id       = (known after apply)
          + location = "eastus"
          + name     = "rg-free-demo"
          + source   = "created"
        }
    }
  + resource_ids       = {
      + networks         = {
          + vnet-demo = (known after apply)
        }
      + resource_groups  = {
          + rg-demo = (known after apply)
        }
      + security_groups  = {
          + nsg-web = (known after apply)
        }
      + subnets          = {
          + vnet-demo = {
              + subnet-public = (known after apply)
            }
        }
      + virtual_machines = {
          + vm-web = (known after apply)
        }
    }
  + security_groups    = {
      + nsg-web = {
          + id     = (known after apply)
          + name   = "nsg-web"
          + source = "created"
        }
    }
  + virtual_machines   = {
      + vm-web = {
          + id           = (known after apply)
          + name         = "vm-web-dgc"
          + ssh_command  = "ssh -i ~/.ssh/azure_vm_key.pub azureuser@<VM_PUBLIC_IP>"
          + ssh_key_path = "~/.ssh/azure_vm_key.pub"
          + ssh_username = "azureuser"
        }
    }

Warning: Attribute Deprecated

  with module.vnet["vnet-demo"].azapi_resource.vnet,
  on .terraform/modules/vnet/main.virtual.network.tf line 1, in resource "azapi_resource" "vnet":
   1: resource "azapi_resource" "vnet" {

The `multiplier` attribute is deprecated and will be removed in a future
version.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pushed by: @iblake*